gustavowd/FreePMU/STM32F769_EWizard/Src/tarefasPMU.c
		send_serial = 0;


		r=0;
		s=1;
		t=2;

		somaMr=0;
		somaMs=0;
		somaMt=0;

		somaFr=0;
		somaFs=0;
		somaFt=0;


		//Aplicacao da DFT
		int k2 = 0;
		for (k=0;k<n_amostras;k++){

			modulor = FasesAC[r]*cosseno[k];
			modulos = FasesAC[s]*cosseno[k];
			modulot = FasesAC[t]*cosseno[k];

			//##############################
			// Para FFT
			FasesAC_ReIm_R[k2]=FasesAC[r];
			FasesAC_ReIm_S[k2]=FasesAC[s];
			FasesAC_ReIm_T[k2]=FasesAC[t];
			FasesAC_ReIm_R[k2+1]=0;
			FasesAC_ReIm_S[k2+1]=0;
			FasesAC_ReIm_T[k2+1]=0;

			k2 += 2;
			//##############################

			faser = FasesAC[r]*seno[k];
			fases = FasesAC[s]*seno[k];
			faset = FasesAC[t]*seno[k];

			somaMr += modulor;
			somaMs += modulos;
			somaMt += modulot;

			somaFr += faser;
			somaFs += fases;
			somaFt += faset;

			r +=3;
			s +=3;
			t +=3;
		}

		//##############################
		// Para FFT
#if 1
		arm_cfft_f32(&arm_cfft_sR_f32_len256,FasesAC_ReIm_R,0,1);
		arm_cmplx_mag_f32(FasesAC_ReIm_R,FasesAC_mod_R,256);

		arm_cfft_f32(&arm_cfft_sR_f32_len256,FasesAC_ReIm_S,0,1);
		arm_cmplx_mag_f32(FasesAC_ReIm_S,FasesAC_mod_S,256);

		arm_cfft_f32(&arm_cfft_sR_f32_len256,FasesAC_ReIm_T,0,1);
		arm_cmplx_mag_f32(FasesAC_ReIm_T,FasesAC_mod_T,256);
#endif
		//##############################


		//Fasor em coordenadas retangulares
		Mr=somaMr*2/n_amostras;
		Ms=somaMs*2/n_amostras;
		Mt=somaMt*2/n_amostras;

		Fr=somaFr*2/n_amostras;
		Fs=somaFs*2/n_amostras;
		Ft=somaFt*2/n_amostras;

		//Fasor em coordenadas polares
		Mag_R = (sqrt((Mr*Mr)+(Fr*Fr)))/sqrt(2);
		Mag_S = (sqrt((Ms*Ms)+(Fs*Fs)))/sqrt(2);
		Mag_T = (sqrt((Mt*Mt)+(Ft*Ft)))/sqrt(2);

		Fase_R = (atan2(-Fr,Mr)*180/M_PI);
		Fase_S = (atan2(-Fs,Ms)*180/M_PI);
		Fase_T = (atan2(-Ft,Mt)*180/M_PI);

		//Desvio de fase (para estimacao de frequencia)
		desvio_faseR = (Fase_R-Fase_R_ant);
		desvio_faseS = (Fase_S-Fase_S_ant);
		desvio_faseT = (Fase_T-Fase_T_ant);


		Fase_R_ant = Fase_R;
		Fase_S_ant = Fase_S;
		Fase_T_ant = Fase_T;



		// Correção do phase shift
		//Desabilitar essa correção para os testes de frequência em estado estacionário!!
/*
		if(desvio_faseR > (desvio_ang_esp+tolerancia)){
			desvio_faseR = desvio_ang_esp;
		}
		if(desvio_faseR < (desvio_ang_esp-tolerancia)){
			desvio_faseR = desvio_ang_esp;
		}

		if(desvio_faseS > (desvio_ang_esp+tolerancia)){
			desvio_faseS = desvio_ang_esp;
		}
		if(desvio_faseS < (desvio_ang_esp-tolerancia)){
			desvio_faseS = desvio_ang_esp;
		}

		if(desvio_faseT > (desvio_ang_esp+tolerancia)){
			desvio_faseT = desvio_ang_esp;
		}
		if(desvio_faseT < (desvio_ang_esp-tolerancia)){
			desvio_faseT = desvio_ang_esp;
		}
*/


		// Correcao da regiao de 180 graus para o desvio de fase
		if(desvio_faseR>270){
			desvio_faseR = desvio_faseR-360;
		}
		if(desvio_faseR<-270){
			desvio_faseR = desvio_faseR+360;
		}
		if(desvio_faseS>270){
			desvio_faseS = desvio_faseS-360;
		}
		if(desvio_faseS<-270){
			desvio_faseS = desvio_faseS+360;
		}
		if(desvio_faseT>270){
			desvio_faseT = desvio_faseT-360;
		}
		if(desvio_faseT<-270){
			desvio_faseT = desvio_faseT+360;
		}





		//FREQUENCIA E ROCOF FINAL (sem correcoes)
		//Calculo da freq para 30 pulsos e 3 fases

		freq_R = f0 + (desvio_faseR*fps)/360.0;
		freq_S = f0 + (desvio_faseS*fps)/360.0;
		freq_T = f0 + (desvio_faseT*fps)/360.0;



		Freq = (freq_R+freq_S+freq_T)/3.0;
		//Freq = 60;


		if(f0 == 50){
			if(Freq > 55){
				Freq = 55;
			}else if(Freq < 45){
				Freq = 45;
			}
		}else if(f0 == 60){
			if(Freq > 65){
				Freq = 65;
			}else if(Freq < 55){
				Freq = 55;
			}
		}



		media_freq_2 = (Freq + Freq_ant)/2.0;

		//Desvio de ângulo esperado (para correção do phase shift)
		desvio_ang_esp = 360*(Freq-f0)/fps;


		ROCOF = (Freq - Freq_ant)*fps;

		Freq_ant = Freq;

		//media movel no valor final do rocof
		n=3;
		vetor_rocof[g] = ROCOF;
		g++;
		for(i=0;i<n;i++){
		    soma_rocof = soma_rocof + vetor_rocof[i];
		    media_rocof = soma_rocof/n;
		}
		soma_rocof = 0;
		if(g==n){
		    g=0;
		}


		// Media movel no valor final da frequencia
		vetor_freq[f] = Freq;
		f++;
		for(i=0;i<2;i++){
		    soma_freq = soma_freq + vetor_freq[i];
		    media_freq = soma_freq/2.0;
		}
		soma_freq = 0;
		if(f==2){
		    f=0;
		}

		Freq_final = media_freq; //+media_rocof/fps;






		// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! TESTES SEM SINAL
		//media_freq = f0;  /////////////////// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
		//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

/*		if(a<25){
			TIM8->ARR = (float)180000000/((50)*n_amostras);
			a++;
		}

*/

#if 1
		//AJUSTE DA TAXA DE AMOSTRAGEM
	#if (OVERSAMPLING  == 1)
		volatile float tmpARR = (float)MCLOCK_FREQ/((media_freq)*n_amostras*4*2);
		#else
		volatile float tmpARR = (float)MCLOCK_FREQ/((media_freq)*n_amostras);
	#endif
		volatile uint32_t tmpARRfix = (uint32_t)tmpARR;
		volatile float residual = tmpARR - (float)tmpARRfix;

		// O valor correto é o calculado - 1
		/* No entanto, se o valor depois da virgula for maior que 0.5
		   considera-se que o valor não precisa ser diminuido de 1 */
#if 1
		if (residual > 0.5){
			htim1.Instance->ARR = tmpARRfix;
		}else{
			htim1.Instance->ARR = tmpARRfix - 1;
		}
#else
		htim1.Instance->ARR = tmpARRfix - 1;
#endif

		//htim1.Instance->ARR = (float)MCLOCK_FREQ/((media_freq)*n_amostras);

		//APLICAÇÃO DAS CORREÇÕES (em magnitude e fase)

		//MAGNITUDE- ajuste da magnitude
		// Y-data = Magnitude reference - X-data = Magnitude measured (não em p.u.)


		mag = Mag_R;
		MagR_x_mag = (float)-0.0018945693 + (float)4.1062603119*mag;
		MagR_x_mag += (float)-0.0077128570*mag*mag;
		MagR_x_mag += (float)0.0262579711*mag*mag*mag;
		MagR_x_mag += (float)-0.0142115525*mag*mag*mag*mag;

		mag = Mag_S;
		MagS_x_mag = (float)-0.0018945693+(float)4.1062603119*mag;
		MagS_x_mag += (float)-0.0077128570*mag*mag;
		MagS_x_mag += (float)0.0262579711*mag*mag*mag;
		MagS_x_mag += (float)-0.0142115525*mag*mag*mag*mag;

		mag = Mag_T;
		MagT_x_mag = (float)-0.0018945693+(float)4.1062603119*mag;
		MagT_x_mag += (float)-0.0077128570*mag*mag;
		MagT_x_mag += (float)0.0262579711*mag*mag*mag;
		MagT_x_mag += (float)-0.0142115525*mag*mag*mag*mag;


		//FASE
		//correcao de fase em funcao da magnitude
		// Y-data = Phase deviation - X-data = Magnitude measured (não em p.u.)

		mag = MagR_x_mag;
		faseR_x_mag = (float)-1.2595979549+(float)0.4039280602*mag;
		faseR_x_mag += (float)-0.1010751752*mag*mag;
		faseR_x_mag += (float)0.0096132710*mag*mag*mag;

