gustavowd/FreePMU/STM32F769_EWizard/Src/tarefasPMU.c
///////////////// FRAME DE CABEÇALHO
int frame_header(void)
{

	//unsigned char ucData[20];

	// 1. SYNC = Data Message Sync Byte andFrame Type
	ucData[0] = A_SYNC_AA;
	ucData[1] = A_SYNC_HDR;

	// 2. FRAMESIZE = Tamanho do frame, incluindo CHK
	ucData[2] = (unsigned char)0x00;
	ucData[3] = (unsigned char)0x15; // 21 em decimal

	// 3. IDCODE = ID da fonte de transmissao
	ucData[4] = (unsigned char)((PmuID & 0xFF00) >> 8);
	ucData[5] = (unsigned char)(PmuID & 0x00FF);

	// 4. SOC = Second Of Century = Estampa de tempo, segundo secular
	ucData[6] = (unsigned char)((SOC & 0xFF000000) >> 24);
	ucData[7] = (unsigned char)((SOC & 0x00FF0000) >> 16);
	ucData[8] = (unsigned char)((SOC & 0x0000FF00) >> 8);
	ucData[9] = (unsigned char)(SOC & 0x000000FF);

	// 5. FRACSEC = Fração do segundo e qualidade do tempo
	ucData[10] = (unsigned char)((FracSec & 0xFF000000) >> 24);  //Time quality (seção 6.2.2)
	ucData[11] = (unsigned char)((FracSec & 0x00FF0000) >> 16);  //fracsec
	ucData[12] = (unsigned char)((FracSec & 0x0000FF00) >> 8);   //fracsec
	ucData[13] = (unsigned char)(FracSec & 0x000000FF);			//fracsec

	// 6. DATA = qualquer coisa
	ucData[14] = (unsigned char)(1);
	ucData[15] = (unsigned char)(2);
	ucData[16] = (unsigned char)(3);
	ucData[17] = (unsigned char)(4);

	//21. CRC-CCITT = Calcula o CRC

	CRC_CCITT = ComputeCRC(ucData, 19);

	ucData[18] = (unsigned char)((CRC_CCITT & 0xFF00) >> 8);
	ucData[19] = (unsigned char)(CRC_CCITT & 0x00FF);

	return 19+1;
}

//Callback chamado quando o ADC finaliza a conversão
//extern void MX_TIM2_Init(void);
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc){
	//Interrompe o TIM1 e zera sua contagem atribuindo 0 ao Auto Reload Register
	htim1.Instance->CR1 &= ~(TIM_CR1_CEN);
	htim1.Instance->CNT = 0;

	BSP_LED_Toggle(LED1);

#if 0
	// Se for a primeira aquisição...
	if (trigcount == 0) {
		// Configura o TIM1 para ser trigado pelo TIM2 (ITR1)
		TIM_SlaveConfigTypeDef sSlaveConfig;
		sSlaveConfig.SlaveMode = TIM_SLAVEMODE_TRIGGER;
		sSlaveConfig.InputTrigger = TIM_TS_ITR1;
		sSlaveConfig.TriggerPolarity = TIM_TRIGGERPOLARITY_NONINVERTED;
		sSlaveConfig.TriggerPrescaler = TIM_TRIGGERPRESCALER_DIV1;
		sSlaveConfig.TriggerFilter = 0;
		HAL_TIM_SlaveConfigSynchronization(&htim1, &sSlaveConfig);

		trigcount++;
	}
	// Do contrario, o TIM2 já está iniciado
	else {
		//Então conta-se um pulso
		trigcount++;

		if (trigcount > 29) {
			// Caso o número de pulsos-1 tenha sido atingido, o TIM2 é interrompido
			htim2.Instance->CR1 &= ~(TIM_CR1_CEN);
			htim2.Instance->CNT = 0;

			// O TIM1 é reestabelecido para ser disparado externamente
			TIM_SlaveConfigTypeDef sSlaveConfig;
			sSlaveConfig.SlaveMode = TIM_SLAVEMODE_TRIGGER;
			sSlaveConfig.InputTrigger = TIM_TS_ETRF;
			sSlaveConfig.TriggerPolarity = TIM_TRIGGERPOLARITY_NONINVERTED;
			sSlaveConfig.TriggerPrescaler = TIM_TRIGGERPRESCALER_DIV1;
			sSlaveConfig.TriggerFilter = 0;
			HAL_TIM_SlaveConfigSynchronization(&htim1, &sSlaveConfig);

			// E a contagem de pulsos zerada
			trigcount = 0;
		}
	}
#endif
	osSemaphoreRelease(pmuSem_id);
}
